In [ ]:
#Взяла таблицу премиум с августа по ноябрь 
#Разделила всех пользователей в августе на юрент-пользователей и на неюрент-пользователей
#Посмотрела в динамике: оказалось, что юрент-пользователи уменьшаются, а неюрент-пользователи увеличиваются

In [56]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns 
import datetime
df = pd.read_csv('premium_subs8_11_2022.csv', sep=";")
df['month'] = pd.to_datetime(df['business_dt']).dt.month
df

              msisdn business_dt  month
0        79883884645  2022-08-31      8
1        79859192789  2022-10-31     10
2        79180825325  2022-08-31      8
3        79898698344  2022-08-31      8
4        79184256551  2022-08-31      8
...              ...         ...    ...
3418267  79877015450  2022-11-30     11
3418268  79874153299  2022-11-30     11
3418269  79195721567  2022-11-30     11
3418270  79199328472  2022-11-30     11
3418271  79122482607  2022-11-30     11

[3418272 rows x 3 columns]

In [57]:
urent = pd.read_csv('ua_urent_2207_2209.csv', sep=",")
urent.drop(urent[urent['month of use'] != '2022-08-01'].index, inplace = True)
urent

            msisdn month of use
35410  79169383626   2022-08-01
35411  79602224402   2022-08-01
35412  79101533851   2022-08-01
35413  79811466835   2022-08-01
35414  79183050933   2022-08-01
...            ...          ...
74135  79150428560   2022-08-01
74136  79362518010   2022-08-01
74137  79614233316   2022-08-01
74138  79850793005   2022-08-01
74139  79850084794   2022-08-01

[38730 rows x 2 columns]

In [54]:
df['isUrent'] = np.where(df['msisdn'].isin(urent['msisdn']), 'Urent_users_from_august', 'Not_urent_users_from_august')
df

              msisdn business_dt  month                      isUrent
0        79883884645  2022-08-31      8  Not_urent_users_from_august
1        79859192789  2022-10-31     10  Not_urent_users_from_august
2        79180825325  2022-08-31      8  Not_urent_users_from_august
3        79898698344  2022-08-31      8  Not_urent_users_from_august
4        79184256551  2022-08-31      8  Not_urent_users_from_august
...              ...         ...    ...                          ...
3418267  79877015450  2022-11-30     11  Not_urent_users_from_august
3418268  79874153299  2022-11-30     11  Not_urent_users_from_august
3418269  79195721567  2022-11-30     11  Not_urent_users_from_august
3418270  79199328472  2022-11-30     11  Not_urent_users_from_august
3418271  79122482607  2022-11-30     11  Not_urent_users_from_august

[3418272 rows x 4 columns]

In [55]:
cohorts = df.pivot_table(index = 'isUrent',
                                               columns = 'month',
                                               values = 'msisdn', 
                                               aggfunc = 'nunique')
cohorts

month                            8       9       10      11
isUrent
Not_urent_users_from_august  570755  816336  698232  751311
Urent_users_from_august        5413    6077    3573    3292